"""
数据结构和算法大纲如下:
    数据结构:
        概述: 存储,组织数据的方式
        分类:
            线性结构
                概述:
                    每个节点只能有个前驱动点 和 一个后继节点
                举例:
                    栈\队列\链表
                具体的存储方式
                    顺序表:
                        概述/特点:
                            连续的存储空间
                        分类:
                            一体式存储: 地址(域) 和 数据(域)在一起
                            分离式存储: 地址(域) 和 数据(域) 分开
                        细节:
                            无论是一体式存储,还是分离式存储,根据索引获取的元素时,时间复杂度都是: O(1)
                    链表：
                        概述 / 特点:
                            非连续的存储空间,有地方就行
            非线性结构:
                概述
                举例
"""